tap "hashicorp/tap"
tap "powershell/tap"
tap "jorgelbg/tap"    # pinentry-touchid
#tap "azure/azd"      # Azure Developer CLI
#tap "azure/bicep"    # Azure Bicep CLI
tap "azure/functions" # Azure Functions Core Tools
brew "mas"

# Git and its dependencies
brew "git"
brew "git-delta"

# GitHub CLI and its dependencies
brew "gh"
brew "glow"

# Neovim and its dependencies
brew "neovim"
brew "ast-grep"
brew "fd"
brew "fzf"
brew "lazygit"
brew "node"
brew "php"
brew "pnpm"
brew "ripgrep"
brew "tree-sitter-cli"
brew "yarn"


# Cloud/Terraform related formulae
brew "awscli"
brew "aztfexport"
brew "azure-cli"
brew "azqr"
brew "azure-functions-core-tools@4"
brew "checkov"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "powershell/tap/powershell"
brew "pre-commit"
brew "terraform-docs"
brew "tf-summarize"
brew "tflint"
brew "trivy"
brew "node@22" # for compat with Azure Functions


# Container Environment
#brew "colima"
cask "docker"
cask "docker-desktop"
brew "devcontainer"
#brew "podman"


# CLI tools
brew "bat"
brew "conda-zsh-completion"
brew "coreutils"
brew "dockutil"
brew "doggo"
brew "dos2unix"
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "gnupg"
brew "gnu-sed"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "miniconda"
#brew "mycli"
brew "pinentry-mac"
brew "jorgelbg/tap/pinentry-touchid"
#brew "pstree"
brew "rsync"
brew "starship"
brew "tree"
brew "watch"
brew "xidel"

# Music Production
cask "native-access"
cask "vcv-rack"
mas "Logic Pro", id: 634148309


# Casks
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "drawio"
cask "firefox"
cask "focusrite-control-2"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "iina"
cask "parsec"
cask "raycast"
cask "visual-studio-code"
cask "wezterm"


# VS Code extensions
vscode "docker.docker"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "vscodevim.vim"


# AppStore
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Bee DICOM Viewer", id: 1590273176
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brother P-touch Editor", id: 1453365242
mas "Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "iFinance 5", id: 1500241909
mas "keymapp", id: 6472865291
mas "Mactracker", id: 430255202
mas "OneDrive", id: 823766827
mas "Purple Tree", id: 764936294
mas "Remote Desktop", id: 409907375
