tap "homebrew/bundle"
brew "mas"

# Git and its dependencies
brew "git"
brew "git-delta"

# GitHub CLI and its dependencies
brew "gh"
brew "glow"

# Neovim and its dependencies
brew "neovim"
brew "ast-grep"
brew "fd"
brew "fzf"
brew "lazygit"
brew "node"
brew "pnpm"
brew "ripgrep"
brew "yarn"


# Cloud/Terraform related formulae
brew "azure-cli"
#brew "hashicorp/tap/packer"
#brew "hashicorp/tap/terraform"
#brew "terraform-docs"
#brew "tflint"
#brew "trivy"


# Container Environments
#brew "colima"
#brew "docker"
#brew "podman"


# CLI tools
brew "bat"
brew "coreutils"
brew "doggo"
brew "dos2unix"
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "gnupg"
brew "gnu-sed"
brew "httpie"
brew "imagemagick"
brew "jq"
#brew "mycli"
brew "pinentry-mac"
#brew "pstree"
brew "tree"
brew "watch"

# Music Production
cask "native-access"
cask "vcv-rack"
mas "Logic Pro", id: 634148309


# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "displaylink"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "iina"
cask "visual-studio-code"
cask "wezterm"


# AppStore
mas "1Password for Safari", id: 1569813296
mas "Bee DICOM Viewer", id: 1590273176
mas "AdGuard for Safari", id: 1440147259
mas "Brother P-touch Editor", id: 1453365242
mas "Disk Speed Test", id: 425264550
mas "iFinance 5", id: 1500241909
mas "Keymapp", id: 6472865291
mas "Mactracker", id: 430255202
mas "Purple Tree", id: 764936294
mas "Remote Desktop", id: 409907375
mas "Vimari", id: 1480933944
mas "Windows App", id: 1295203466
